
public class Task3 {

	public static void main(String[] args) {

		// Task 3
		// Написать программу, которая умеет складывать 2 числа типа int и выводить
		// результат на экран.

		int a = 3;
		int b = 5;
		int result = a + b;
		System.out.println("First number = " + a);
		System.out.println("Second number = " + b);
		System.out.println("First number + Second number = " + result);

	}
}
