public class Task1And2 {

	// Task 1
	// Написать консольное приложение, которое выводит на экран надпись “Hello
	// World!”

	public static void main(String[] args) {
		System.out.println("Hello Java!");

		// Task 2
		// Распечатать на экране свое ФИО. Фамилия, Имя и Отчество должны выводиться на
		// разных строках.

		String myname = "Aleksey";
		String mysurname = "Sprynchan";
		String myotchestvo = "Aleksandrovich";
		System.out.println(mysurname);
		System.out.println(myname);
		System.out.println(myotchestvo);
	}
}
